#include "HardwareProfile.h"
#include <string.h>
#include <ctype.h>
#include "..\..\..\WF_Device\SimSPI.h"
#include "..\..\..\WF_Device\CP1616_Client.h"
#include "Function.h"
void InitMCU(void)             //系统初始化程序
{
	/************************************************************************/
	/* AD                                              */
	/************************************************************************/
	ADCON1=0b00001111;//AN0:电位器调节，AN1：电流信号 
	CMCON=0x07;	
	
	TRISC=TRISC&0xc0;
	TRISB1=0;
	TRISB2=0;
	DAC0832_WR_W=1;
	DAC0832_CS_W=1;
	DAC0832_CS_IO=0;
	DAC0832_WR_IO=0;

	TB_W=0;
	TB_IO=0;
	/************************************************************************/
	/* TMR0   计时						         	*/
	/************************************************************************/
 	T0CON=0b10000010;//关闭，定时器，1:8,2us
 	SetTMR0();
 	TMR0IP=0;//低优先级
 	TMR0IE=1;//使能中断
 	TMR0IF=0;//清中断标志
	/************************************************************************/
	/* 串口1																*/
	/************************************************************************/
	TRISC7=1;
	TRISC6=1;
	TXSTA=0b00100010;//异步方式、使能发送(bit6=1是9位数据)八位字长、高波特率(bit2低速0)
	RCSTA=0b10010000; //使能串口、使能接收、异步方式、(bit6=1是9位数据)八位字长
	//BAUDCON1=0x40;//不用自动波特率自动检测
	SPBRG=0x67;	//Baud Rate = Fosc/(16(SPBRG+1)) = 9600
	RCIP=0;//低优先级
	RCIE=1;//使能中断
	RCIF=0;//清中断标志	

	/************************************************************************/
	/* 全局中断																*/
	/************************************************************************/
	//IPEN=1;//使能中断的优先级
	PEIE=1;
	GIE=1;
}
void InitVariable(void)
{
	gFlags.bFastMode=0;
}
void InitSystem( void )
{
	unsigned int i;
	InitMCU();
	InitVariable();
	CP1616_Client_Init();
	DAC0832_WriteData(0);	
}
